## Pandas Library (External Library)

In [1]:
# Install Pandas Library
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\croma campus\appdata\roaming\python\python313\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.26.0 in c:\users\croma campus\appdata\roaming\python\python313\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\croma campus\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\croma campus\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\croma campus\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\croma campus\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.1.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
# Pandas is used for working on data
# Series (list , Single Dimension Array)
# Dataframe (2D Data , Tabular Format)

In [4]:
# Importing libraries
import pandas as pd

In [21]:
# Creating Dummy Data
data = {
    'Stu_ID':[101,102,103,104,105,106,107],
    'Stu_Name':['Raj','Riya','Mahi','Soni','Riya','Rahul','Yogesh'],
    'Marks':[78,35,47,13,79,46,35]
}

In [22]:
# Creating a dataframe (2D Dataset)
df = pd.DataFrame(data)

In [23]:
df

   Stu_ID Stu_Name  Marks
0     101      Raj     78
1     102     Riya     35
2     103     Mahi     47
3     104     Soni     13
4     105     Riya     79
5     106    Rahul     46
6     107   Yogesh     35

In [24]:
# By default , head will print first 5 rows
df.head()

   Stu_ID Stu_Name  Marks
0     101      Raj     78
1     102     Riya     35
2     103     Mahi     47
3     104     Soni     13
4     105     Riya     79

In [25]:
df.head(2)

   Stu_ID Stu_Name  Marks
0     101      Raj     78
1     102     Riya     35

In [26]:
# tail will print last 5 rows by default
df.tail()

   Stu_ID Stu_Name  Marks
2     103     Mahi     47
3     104     Soni     13
4     105     Riya     79
5     106    Rahul     46
6     107   Yogesh     35

In [27]:
df.tail(3)

   Stu_ID Stu_Name  Marks
4     105     Riya     79
5     106    Rahul     46
6     107   Yogesh     35

In [28]:
# Printing Column Names
df.columns

Index(['Stu_ID', 'Stu_Name', 'Marks'], dtype='object')

In [29]:
df.Stu_ID

0    101
1    102
2    103
3    104
4    105
5    106
6    107
Name: Stu_ID, dtype: int64

In [30]:
df.Stu_Name

0       Raj
1      Riya
2      Mahi
3      Soni
4      Riya
5     Rahul
6    Yogesh
Name: Stu_Name, dtype: object

In [31]:
df['Stu_ID']

0    101
1    102
2    103
3    104
4    105
5    106
6    107
Name: Stu_ID, dtype: int64

In [32]:
df.Marks

0    78
1    35
2    47
3    13
4    79
5    46
6    35
Name: Marks, dtype: int64

In [33]:
df['Marks']

0    78
1    35
2    47
3    13
4    79
5    46
6    35
Name: Marks, dtype: int64

In [35]:
# Calculating sum of a column
df.Marks.sum()

np.int64(333)

In [42]:
# Calculating Average of a column
print("Average Marks :",round(df.Marks.sum()/len(df),2))

Average Marks : 47.57

In [43]:
# Counting number of rows in a dataframe
len(df)

7

### Dataset
Find Business Insights and Trends (Hidden Information)<br>
1- Data Collection<br>
2- Data Cleaning<br>
    - null/Blank cell , row , column , duplicate etc <br>
    remove , replace , repair etc<br>
3- Data Transformation<br>

Netflix / Edtech (Croma)<br>

1h 13m  =>  1*60+13 => 73<br>
1h 05m<br>
1h    1*60+<br>
59m     59*60+<br>
1h 15m<br>

4- Column Transformation<br>
5- Data Visualization <br>
(Bussiness Insights / Trends => Narration)<br>

0.0% - 1.0% (You can think about remove)<br>